"use client";

import Head from "next/head";

import AboutHeroSection from "@/components/About/AboutHeroSection";
import Container from "@/components/Container";
import Stats from "@/components/Home/Stats";

export default function AboutPage() {
  return (
    <>
      <Head>
        <title>Про нас — команда В.О.Л.Я.</title>
        <meta
          content="Дізнайтеся про нашу місію, цінності та історію створення бренду «В.О.Л.Я.» — людей, які роблять якість і гостинність понад усе."
          name="description"
        />
      </Head>

      <AboutHeroSection />

      <Stats
        className=" bg-gray-500 py-[25px]"
        data={[
          { label: "Років досвіду", value: 12 },
          { label: "Співробітників у команді", value: 60 },
          { label: "Реалізованих проєктів", value: 75 },
        ]}
      />

      <Container className="py-12 space-y-6 text-gray-700 text-base leading-relaxed">
        <p>
          Ми— це згуртована команда професіоналів, яка щоденно працює над тим,
          щоб створювати незабутній сервіс і найкращий досвід для наших гостей.
          Почавши свій шлях як невеликий стартап із кількох ентузіастів, ми
          поступово перетворилися на міцну дружню організацію, де кожен
          співробітник привносить свої унікальні знання та талант.
        </p>

        <p>
          У нашій команді ви зустрінете креативних шеф-кухарів, які постійно
          експериментують зновими рецептами, уважних менеджерів, які завжди
          готові зробити ваше перебування максимально комфортним, а також
          привітних працівників, що щиро дбають про кожного гостя.
        </p>

        <div>
          <h3 className="font-semibold mb-2">Наші основні цінності:</h3>
          <ul className="list-disc list-inside space-y-1">
            <li>
              <b>Якість</b> — ми завжди обираємо найкращі продукти та послуги,
              щоб забезпечити бездоганний результат.
            </li>
            <li>
              <b>Інновації</b> — ми небоїмося впроваджувати нові ідеї та
              рішення, роблячи ваш відпочинок сучасним і приємним.
            </li>
            <li>
              <b>Людяність</b> — кожен гість для нас особливий, тому ми завжди
              допоможемо і подбаємо про ваш комфорт.
            </li>
          </ul>
        </div>

        <p>
          Завітайте до нас і переконайтеся самі: у «В[/\]Я» завжди тепло,
          затишно й привітно!
        </p>

        <div>
          <h3 className="font-semibold mb-2">Контактна інформація:</h3>
          <p>
            Телефон:{" "}
            <a className="underline" href="tel:+380661927167">
              +380(66)1927167
            </a>
          </p>
          <p>
            Email:
            <a className="underline" href="mailto:info@ourhotel.com">
              reception@volyahotel.com
            </a>
          </p>
          <p>
            Адреса: вул.Аркадія, Ліве крило2/1, Одеса, Одеська область, Україна
          </p>
        </div>
      </Container>
    </>
  );
}
